CSI API ETABS v1
cPropArea.SetSlab Method
 Initializes a slab property.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSlab(
	string Name,
	eSlabType SlabType,
	eShellType ShellType,
	string MatProp,
	double Thickness,
	int color = -1,
	string notes = "",
	string GUID = ""
)
Function SetSlab (
	Name As String,
	SlabType As eSlabType,
	ShellType As eShellType,
	MatProp As String,
	Thickness As Double,
	Optional color As Integer = -1,
	Optional notes As String = "",
	Optional GUID As String = ""
) As Integer
Dim instance As cPropArea
Dim Name As String
Dim SlabType As eSlabType
Dim ShellType As eShellType
Dim MatProp As String
Dim Thickness As Double
Dim color As Integer
Dim notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetSlab(Name, SlabType,
	ShellType, MatProp, Thickness, color,
	notes, GUID)
int SetSlab(
	String^ Name,
	eSlabType SlabType,
	eShellType ShellType,
	String^ MatProp,
	double Thickness,
	int color = -1,
	String^ notes = L"",
	String^ GUID = L""
)
abstract SetSlab :
        Name : string *
        SlabType : eSlabType *
        ShellType : eShellType *
        MatProp : string *
        Thickness : float *
        ?color : int *
        ?notes : string *
        ?GUID : string
(* Defaults:
        let _color = defaultArg color -1
        let _notes = defaultArg notes ""
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
 The name of a slab property. If this is an existing property, that property is modified; otherwise, a new property is added.
SlabType
Type: ETABSv1.eSlabType
 This is one of the items in the eSlabType enumeration.
 If this item is Ribbed, use the GetSlabRibbed(String, Double, Double, Double, Double, Double, Int32) function to get additional parameters.
 If this item is Waffle, use the GetSlabWaffle(String, Double, Double, Double, Double, Double, Double) function to get additional parameters.
ShellType
Type: ETABSv1.eShellType
 This is one of the items in the eShellType enumeration.
MatProp
Type: System.String
 The name of the material property for the area property.
 This item does not apply when ShellType is Layered.
Thickness
Type: System.Double
 The membrane thickness. [L]
 This item does not apply when ShellType is Layered.
color (Optional)
Type: System.Int32
The display color assigned to the property.
notes (Optional)
Type: System.String
The notes, if any, assigned to the property.
GUID (Optional)
Type: System.String
The GUID (global unique identifier), if any, assigned to the property.
Return Value
Type: Int32
 Returns zero if the property is successfully initialized; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim SlabType As eSlabType
       Dim ShellType As eShellType
       Dim MatProp As String
       Dim Thickness As Double
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
    'set new area property
       ret = SapModel.PropArea.SetSlab("MyShellProp1A", eSlabType.Drop, eShellType.ShellThin, "4000Psi", 14.2)
    'get area property data
       ret = SapModel.PropArea.GetSlab("MyShellProp1A", SlabType, ShellType, MatProp, Thickness, Color, Notes, GUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace